; domain
(define (domain grid)
  (:requirements :strips)
  (:predicates
    ; types
    (place ?x)
    (key ?k)
    (shape ?s)
    ; static predicates
    (conn ?x ?y)
    (key-shape ?k ?s)
    (lock-shape ?x ?s)
    ; fluents
    (at ?k ?x)
    (at-robot ?x)
    (holding ?k)
    (arm-empty)
    (locked ?x)
    (open ?x)
  )

  ; move from ?curpos to adjacent ?nextpos that is open
  (:action move
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos)
                       (place ?nextpos)
                       (conn ?curpos ?nextpos)
                       (at-robot ?curpos)
                       (open ?nextpos))
    :effect (and (at-robot ?nextpos)
                 (not (at-robot ?curpos))))

  ; pick ?key that is at ?curpos when not holding another key
  (:action pickup
    :parameters (?curpos ?key)
    :precondition (and (place ?curpos)
                       (key ?key)
                       (at ?key ?curpos)
                       (at-robot ?curpos)
                       (arm-empty))
    :effect (and (holding ?key)
                 (not (at ?key ?curpos))
                 (not (arm-empty))))

  ; pick ?newkey at ?curpos while holding/dropping ?oldkey (equiv. to putdown followed by pickup)
  (:action pickup-and-loose
    :parameters (?curpos ?newkey ?oldkey)
    :precondition (and (place ?curpos)
                       (key ?newkey)
                       (key ?oldkey)
                       (at ?newkey ?curpos)
                       (at-robot ?curpos)
                       (holding ?oldkey))
    :effect (and (holding ?newkey)
                 (at ?oldkey ?curpos)
                 (not (holding ?oldkey))
                 (not (at ?newkey ?curpos))))

  ; putdown ?key being held at ?curpos
  (:action putdown
    :parameters (?curpos ?key)
    :precondition (and (place ?curpos)
                       (key ?key)
                       (at-robot ?curpos)
                       (holding ?key))
    :effect (and (arm-empty)
                 (at ?key ?curpos)
                 (not (holding ?key))))

  ; unlock ?lockpos adjacent to ?curpos using ?key begin held of matching ?shape
  (:action unlock
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos)
                       (place ?lockpos)
                       (key ?key)
                       (shape ?shape)
                       (conn ?curpos ?lockpos)
                       (key-shape ?key ?shape)
                       (lock-shape ?lockpos ?shape)
                       (at-robot ?curpos)
                       (locked ?lockpos)
                       (holding ?key))
    :effect (and (open ?lockpos)
                 (not (locked ?lockpos))))
)

; problem
(define (problem grid_2Hroom2_fpl_s3_seed30740_n0)
  (:domain grid)
  (:objects
    p0 p1 p2 p3 p4 p5 p6 p7 p8
    shape0 shape1 shape2
    key0 key1 key2
  )
  (:init
    ; Object types
    (place p0) (place p1) (place p2) (place p3) (place p4) (place p5) (place p6) (place p7) (place p8)
    (shape shape0) (shape shape1) (shape shape2)
    (key key0) (key key1) (key key2)
    ; Open/locked cells
    (open p0) (open p1) (open p2) (open p3) (open p4) (open p5) (open p7) (open p8)
    (locked p6)
    ; Connected cells
    (conn p0 p1)
    (conn p0 p4)
    (conn p1 p0)
    (conn p1 p5)
    (conn p2 p3)
    (conn p2 p7)
    (conn p3 p2)
    (conn p3 p8)
    (conn p4 p0)
    (conn p4 p5)
    (conn p5 p4)
    (conn p5 p1)
    (conn p5 p6)
    (conn p6 p5)
    (conn p6 p7)
    (conn p7 p6)
    (conn p7 p2)
    (conn p7 p8)
    (conn p8 p7)
    (conn p8 p3)
    ; Lock and key shapes
    (lock-shape p6 shape2)
    (key-shape key0 shape0)
    (key-shape key1 shape1)
    (key-shape key2 shape2)
    ; Key placement
    (at key0 p6)
    (at key1 p6)
    (at key2 p8)
    ; Robot placement
    (at-robot p7)
    (arm-empty)
  )
  (:goal (at-robot p1))
)

; plan
1. (move p7 p8)
   deleted: (at-robot p7)
   added: (at-robot p8)
   goals met: 0 of 1
2. (pickup p8 key2)
   deleted: (at key2 p8) (arm-empty)
   added: (holding key2)
   goals met: 0 of 1
3. (move p8 p7)
   deleted: (at-robot p8)
   added: (at-robot p7)
   goals met: 0 of 1
4. (unlock p7 p6 key2 shape2)
   deleted: (locked p6)
   added: (open p6)
   goals met: 0 of 1
5. (move p7 p6)
   deleted: (at-robot p7)
   added: (at-robot p6)
   goals met: 0 of 1
6. (move p6 p5)
   deleted: (at-robot p6)
   added: (at-robot p5)
   goals met: 0 of 1
7. (move p5 p1)
   deleted: (at-robot p5)
   added: (at-robot p1)
   goals met: 1 of 1
